console.log("Sumit Chuahdhary")
const arr = [`नौकरानी- मेम साब जल्दी आइए ,आपके बच्चे ने मच्छर खा लिया है,
मालकिन- अरे जल्दी से डॉक्टर को बुलाओ 
नौकरानी- मालकिन घबराने की कोई बात नहीं 
मैंने बच्चे को All Out पिला दिया है`,
    `अभी छत की 3-4 सीढ़ियां चढ़ा ही था कि
भाभी बोली - कहां जा रहे हो?
टीटू- चिड़िया को दाना देने.
भाभी - तुम्हारी चिड़िया सात दिन के लिए नानी के घर गई है`,
    `गर्लफ्रेंड - जानू, मेरे सिर में बहुत दर्द है.
बॉयफ्रेंड  ने लड़की के सिर को चूमते हुए पूछा - अब सही हुआ?
गर्लफ्रेंड - हां, अब बिल्कुल सही हो गया.
पास`,
    `लड़की का फोन आता है लड़के को
लड़का- हां,  कितने का रिचार्ज करवाऊं?
लड़की- तुम्हे क्या लगता है मैं हर बार रिचार्ज करवाने के लिए ही फ़ोन करती हूं क्या ?
लड़का`,
    `टीचर- कल क्यों नहीं आया?
चिंटू- नहीं बताऊंगा?
टीचर चांटा मारकर- जल्दी बता,
चिंटू- Valentine Day पर गर्लफ्रेंड के साथ था,
टीचर- इतना छोटा होकर भी गर्लफ`,
    `सेल्समैन - सर कॉकरोच के लिए पाउडर लेंगे क्या?
रवि - नहीं हम कॉकरोच को इतना लाड प्यार नहीं करते.
आज पाउडर लगा देंगे, तो कल परफ्यूम मांगेगा.
जवाब सुनकर सेल्समैन बेहोश `,
    `सोया नही था
में पिछले कुछ साल से पर जब तुम
मिले तुमसे बतिया कर लेता हूं
झपकियां
सुकून की`,
    `जीवन क्रम अनवरत चलता ।
बस परिचय परिधान बदलता।।
जिसको कहते हो, तुम, मृत्यु,
वह पूर्ण नहीं अल्प विराम होता है`,
    `मेरे घर में त्योहारों की ,
एक झड़ी सी है लग आई।
गया दशहरा, आने वाली दिवाली,
बीच में करवा चौथ है आई`,
    `तुम्हारी तरह,हम भी तुम्हे छोड़ दें,तो क्या होगा।
रूख अपने ही सफर का मोड़ दें, तो क्या होगा।।`,
    `वो यकीं जो मुद्दतों मे , हमारे दरम्यां हुआ पैदा।
गर वो ही यकीं भी,आज हम तोड़ दें क्या होगा।।`]

function generateJoke() {
    // console.log("hello");
    let a = document.getElementById('jokes');
    let randomNumber = generateRandomNumber(arr.length)
    console.log(randomNumber);
    let jokes = arr[randomNumber]
    
    console.log(jokes)
    a.innerText = jokes
    
}
function generateRandomNumber(max){
    return Math.trunc(Math.random()*max)
}
// let a = [1,2,3,5]
// console.log(a[2]);

